run/burro9/burro9AtmGas/system/distanceLFL
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      distanceLFL;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

distanceLFL
{
    type        distanceToLFL;
    functionObjectLibs ("libfieldFunctionObjects.so");
    enabled         true;
    log             true;
    write           true;
    fields
    (
        CH4
    );
    writeControl  runTime;
    writeInterval   1;
}

// ************************************************************************* //
