run/burro9/burro9AtmGas/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
        tolerance        1e-3;
        relTol           0.1;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }
    
    "(U|h|k|epsilon|omega)"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }

    "(U|h|k|epsilon|omega)Final"
    {
        $U;
        relTol          0;
    }

    Yi
    {
        $hFinal;
    }
}

PIMPLE
{
    nOuterCorrectors  50;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    residualControl
    {
        p_rgh
        {
                tolerance  1e-3;
                relTol      0;
        }

        U
        {
                tolerance  1e-3;
                relTol      0;
        }


        "(h|k|epsilon|omega|Yi)"
        {
                tolerance  1e-4;
                relTol      0;
        }

     }
}

relaxationFactors
{
    fields
    {
        rho             1.0;
        p_rgh           0.3;
        p_rghFinal      1;
    }
    equations
    {
	U 		0.3;
	UFinal 		1;
        "h|k|epsilon|omega|Yi" 0.3;
        "(h|k|epsilon|omega|Yi)Final" 1;
    }
}
// ************************************************************************* //
